["\"I do not fear computers. I fear lack of them.\"— Isaac Asimov  ","\"A computer once beat me at chess, but it was no match for me at kick boxing.\"— Emo Philips  ","\"Computer Science is no more about computers than astronomy is about telescopes.\"— Edsger W. Dijkstra  ","\"The computer was born to solve problems that did not exist before.\"— Bill Gates    ","\"Software is like entropy: It is difficult to grasp, weighs nothing, and obeys the Second Law of Thermodynamics; i.e., it always increases.\"— Norman Augustine   ","\"Software is a gas; it expands to fill its container.\"— Nathan Myhrvold  ","\"All parts should go together without forcing.  You must remember that the parts you are reassembling were disassembled by you.  Therefore, if you can't get them together again, there must be a reason.  By all means, do not use a hammer.\"— IBM Manual, 1925  ","\"Standards are always out of date.  That's what makes them standards.\"— Alan Bennett   ","\"Physics is the universe's operating system.\"— Steven R Garman   ","\"It's hardware that makes a machine fast.  It's software that makes a fast machine slow.\"— Craig Bruce   ","\"Imagination is more important than knowledge.  For knowledge is limited, whereas imagination embraces the entire world, stimulating progress, giving birth to evolution.\"— Albert Einstein   ","\"The greatest enemy of knowledge is not ignorance, it is the illusion of knowledge.\"— Stephen Hawking   ","\"The more you know, the more you realize you know nothing.\"— Socrates   ","\"Tell me and I forget.  Teach me and I remember.  Involve me and I learn.\"— Benjamin Franklin   ","\"Real knowledge is to know the extent of one's ignorance.\"— Confucius   ","\"If people never did silly things, nothing intelligent would ever get done.\"— Ludwig Wittgenstein   ","\"Getting information off the Internet is like taking a drink from a fire hydrant.\"— Mitchell Kapor  ","\"If you think your users are idiots, only idiots will use it.\"— Linus Torvalds   ","\"From a programmer's point of view, the user is a peripheral that types when you issue a read request.\"— P. Williams   ","\"Where is the ‘any' key?\"— Homer Simpson, in response to the message, \"Press any key\"   ","\"Computers are good at following instructions, but not at reading your mind.\"— Donald Knuth   ","\"There is only one problem with common sense; it's not very common.\"— Milt Bryce   ","\"Your most unhappy customers are your greatest source of learning.\"— Bill Gates   ","\"Let us change our traditional attitude to the construction of programs: Instead of imagining that our main task is to instruct a computer what to do, let us concentrate rather on explaining to human beings what we want a computer to do.\"— Donald E. Knuth   ","\"The Internet?  We are not interested in it.\"— Bill Gates, 1993   ","\"The best way to get accurate information on Usenet is to post something wrong and wait for corrections.\"— Matthew Austern   ","\"The most likely way for the world to be destroyed, most experts agree, is by accident.  That's where we come in; we're computer professionals.  We cause accidents.\"— Nathaniel Borenstein   ","\"Pessimists, we're told, look at a glass containing 50% air and 50% water and see it as half empty.  Optimists, in contrast, see it as half full.  Engineers, of course, understand the glass is twice as big as it needs to be.\"— Bob Lewis   ","\"In a room full of top software designers, if two agree on the same thing, that's a majority.\"— Bill Curtis   ","\"It should be noted that no ethically-trained software engineer would ever consent to write a DestroyBaghdad procedure.  Basic professional ethics would instead require him to write a DestroyCity procedure, to which Baghdad could be given as a parameter.\"— Nathaniel S. Borenstein   ","\"Mostly, when you see programmers, they aren't doing anything.  One of the attractive things about programmers is that you cannot tell whether or not they are working simply by looking at them.  Very often they're sitting there seemingly drinking coffee and gossiping, or just staring into space.  What the programmer is trying to do is get a handle on all the individual and unrelated ideas that are scampering around in his head.\"— Charles M. Strauss   ","\"If you think you are worth what you know, you are very wrong.  Your knowledge today does not have much value beyond a couple of years.  Your value is what you can learn and how easily you can adapt to the changes this profession brings so often.\"— Jose M. Aguilar   ","\"Programs must be written for people to read, and only incidentally for machines to execute.\"— Abelson and Sussman   ","\"Commenting your code is like cleaning your bathroom — you never want to do it, but it really does create a more pleasant experience for you and your guests.\"— Ryan Campbell  ","\"We have to stop optimizing for programmers and start optimizing for users.\"— Jeff Atwood   ","\"Low-level programming is good for the programmer's soul.\"— John Carmack   ","\"It's OK to figure out murder mysteries, but you shouldn't need to figure out code.  You should be able to read it.\"— Steve McConnell   ","\"If we wish to count lines of code, we should not regard them as ‘lines produced' but as ‘lines spent.'\"— Edsger Dijkstra   ","\"Programming can be fun, so can cryptography; however they should not be combined.\"— Kreitzberg and Shneiderman  ","\"Before software should be reusable, it should be usable.\"— Ralph Johnson  ","\"If you automate a mess, you get an automated mess.\"— Rod Michael   ","\"Looking at code you wrote more than two weeks ago is like looking at code you are seeing for the first time.\"— Dan Hurvitz   ","\"It is easier to change the specification to fit the program than vice versa.\"— Alan Perlis   ","\"Less than 10% of the code has to do with the ostensible purpose of the system; the rest deals with input-output, data validation, data structure maintenance, and other housekeeping.\"— Mary Shaw   ","\"If you have a procedure with ten parameters, you probably missed some.\"— Alan Perlis  ","\"How rare it is that maintaining someone else's code is akin to entering a beautifully designed building, which you admire as you walk around and plan how to add a wing or do some redecorating. More often, maintaining someone else's code is like being thrown headlong into a big pile of slimy, smelly garbage.\"— Bill Venners   ","\"Code generation, like drinking alcohol, is good in moderation.\"— Alex Lowe   ","\"Simplicity, carried to the extreme, becomes elegance.\"— Jon Franklin   ","\"A program is never less than 90% complete, and never more than 95% complete.\"— Terry Baker   ","\"When you are stuck in a traffic jam with a Porsche, all you do is burn more gas in idle.  Scalability is about building wider roads, not about building faster cars.\"— Steve Swartz   ","\"Everyone by now presumably knows about the danger of premature optimization.  I think we should be just as worried about premature design — designing too early what a program should do.\"— Paul Graham   ","\"Programming without an overall architecture or design in mind is like exploring a cave with only a flashlight: You don't know where you've been, you don't know where you're going, and you don't know quite where you are.\"— Danny Thorpe   ","\"The best way to predict the future is to implement it.\"— David Heinemeier Hansson   ","\"We need above all to know about changes; no one wants or needs to be reminded 16 hours a day that his shoes are on.\"— David Hubel   ","\"On two occasions I have been asked, 'If you put into the machine wrong figures, will the right answers come out?'  I am not able rightly to apprehend the kind of confusion of ideas that could provoke such a question.\"— Charles Babbage   ","\"Make everything as simple as possible, but not simpler.\"— Albert Einstein   ","\"Today, most software exists, not to solve a problem, but to interface with other software.\"— IO Angell   ","\"Good specifications will always improve programmer productivity far better than any programming tool or technique.\"— Milt Bryce   ","\"The difference between theory and practice is that in theory, there is no difference between theory and practice.\"— Richard Moore   ","\"Don't document the problem, fix it.\"— Atli Björgvin Oddsson   ","\"As a rule, software systems do not work well until they have been used, and have failed repeatedly, in real applications.\"— Dave Parnas   ","\"If the code and the comments do not match, possibly both are incorrect.\"— Norm Schryer   ","\"I think it's a new feature.  Don't tell anyone it was an accident.\"— Larry Wall   ","\"If you don't handle [exceptions], we shut your application down.  That dramatically increases the reliability of the system.\"— Anders Hejlsberg   ","\"When debugging, novices insert corrective code; experts remove defective code.\"— Richard Pattis   ","\"In a software project team of 10, there are probably 3 people who produce enough defects to make them net negative producers.\"— Gordon Schulmeyer   ","\"I think it is inevitable that people program poorly.  Training will not substantially help matters.  We have to learn to live with it.\"— Alan Perlis   ","\"Program testing can be a very effective way to show the presence of bugs, but is hopelessly inadequate for showing their absence.\"— Edsger Dijkstra   ","\"Manually managing blocks of memory in C is like juggling bars of soap in a prison shower: It's all fun and games until you forget about one of them.\"— anonymous Usenet user   ","\"There's no obfuscated Perl contest because it's pointless.\"— Jeff Polk   ","\"Java is the most distressing thing to hit computing since MS-DOS.\"— Alan Kay  ","\"There are only two things wrong with C++:  The initial concept and the implementation.\"— Bertrand Meyer   ","\"It was a joke, okay?  If we thought it would actually be used, we wouldn't have written it!\"— Mark Andreesen, speaking of the HTML tag BLINK      ","\"Perl: The only language that looks the same before and after RSA encryption.\"— Keith Bostic   ","\"I didn't work hard to make Ruby perfect for everyone, because you feel differently from me.  No language can be perfect for everyone.  I tried to make Ruby perfect for me, but maybe it's not perfect for you.  The perfect language for Guido van Rossum is probably Python.\"— Yukihiro Matsumoto, aka \"Matz\", creator of Ruby   ","\"XML is not a language in the sense of a programming language any more than sketches on a napkin are a language.\"— Charles Simonyi   ","\"BASIC is to computer programming as QWERTY is to typing.\"— Seymour Papert   ","\"It has been discovered that C++ provides a remarkable facility for concealing the trivial details of a program — such as where its bugs are.\"— David Keppel   ","\"UNIX is simple.  It just takes a genius to understand its simplicity.\"— Dennis Ritchie   ","\"Some people, when confronted with a problem, think ‘I know, I'll use regular expressions.'  Now they have two problems.\"— Jamie Zawinski   ","\"I think computer viruses should count as life.  I think it says something about human nature that the only form of life we have created so far is purely destructive.  We've created life in our own image.\"— Stephen Hawking   ","\"The only truly secure system is one that is powered off, cast in a block of concrete and sealed in a lead-lined room with armed guards.\"— Gene Spafford   ","\"Being able to break security doesn't make you a hacker anymore than being able to hotwire cars makes you an automotive engineer.\"— Eric Raymond   ","\"Companies spend millions of dollars on firewalls, encryption and secure access devices, and it's money wasted, because none of these measures address the weakest link in the security chain.\"— Kevin Mitnick   ","\"If you think technology can solve your security problems, then you don't understand the problems and you don't understand the technology.\"— Bruce Schneier  ","\"Hoaxes use weaknesses in human behavior to ensure they are replicated and distributed.  In other words, hoaxes prey on the Human Operating System.\"— Stewart Kirkpatrick   ","\"Passwords are like underwear: you don't let people see it, you should change it very often, and you shouldn't share it with strangers.\"— Chris Pirillo   ","\"I am not out to destroy Microsoft, that would be a completely unintended side effect.\"— Linus Torvalds   ","\"Yes, we have a dress code. You have to dress.\"— Scott McNealy, co-founder of Sun Microsystems   ","\"In an information economy, the most valuable company assets drive themselves home every night.  If they are not treated well, they do not return the next morning.\"— Peter Chang  ","\"It's better to wait for a productive programmer to become available than it is to wait for the first available programmer to become productive.\"— Steve McConnell","\"I'm not one of those who think Bill Gates is the devil.  I simply suspect that if Microsoft ever met up with the devil, it wouldn't need an interpreter.\"— Nicholas Petreley   ","\"Two years from now, spam will be solved.\"— Bill Gates, 2004   ","\"The problem of viruses is temporary and will be solved in two years.\"— John McAfee, 1988  ","\"Computer viruses are an urban legend.\"— Peter Norton, 1988   ","\"In 2031, lawyers will be commonly a part of most development teams.\"— Grady Booch   ","\"I don't know what the language of the year 2000 will look like, but I know it will be called Fortran.\"— CA Hoare, 1982  ","\"In the future, computers may weigh no more than 1.5 tonnes.\"— Popular mechanics, 1949   ","\"I see little commercial potential for the Internet for at least ten years.\"— Bill Gates, 1994 ", "\"Mars is home to the tallest mountain in our solar system.\"","\"Only 18 out of 40 missions to Mars have been successful.\"","\"Pieces of Mars have fallen to Earth.\"","\"One year on Mars is 687 Earth days.\"","\"The temperature on Mars ranges from -153 to 20 °C.\"","\"One year on Mercury is about 88 Earth days.\"","\"The surface temperature of Mercury ranges from -173 to 427°C.\"","\"Mercury was first discovered in 14th century by Assyrian astronomers.\"","\"Your weight on Mercury would be 38% of your weight on Earth.\"","\"A day on the surface of Mercury lasts 176 Earth days.\"","\"The surface temperature of Venus is about 462 °C.\"","\"It takes Venus 225 days to orbit the sun.\"","\"Venus was first discovered by 17th century Babylonian astronomers.\"","\"Venus is nearly as big as the Earth with a diameter of 12,104 km.\"","\"The Earth's rotation is gradually slowing.\"","\"There is only one natural satellite of the planet Earth, the moon.\"","\"Earth is the only planet in our solar system not named after a god.\"","\"The Earth is the densest planet in the solar system.\"","\"A year on Jupiter lasts around 4333 earth days.\"","\"The surface temperature of Jupiter is around -108°C.\"","\"Jupiter was first discovered by 7th or 8th century Babylonian astronomers.\"","\"Jupiter has 4 ring.\"","\"A day on Jupiter lasts 9 hours and 55 minutes.\"","\"Saturn was first discovered by 8th century Assyrians.\"","\"Saturn takes 10756 days to orbit the Sun.\"","\"Saturn can be seen with the naked eye.\"","\"Saturn is the flattest planet.\"","\"Saturn is made mostly of hydrogen.\"","\"Four spacecraft have visited Saturn.\"","\"Uranus was discovered by William Herschel in 1781.\"","\"A year on Uranus takes 30687 earth days.\"","\"Uranus turns on its axis once every 17 hours, 14 minutes.\"","\"With minimum atmospheric temperature of -224°C Uranus is nearly coldest planet in the solar system.\"","\"Only one spacecraft has flown by Uranus, the Voyager 2.\"","\"Neptune was discovered in 1846 by Urbain Le Verrier and Johann Galle.\"","\"Neptune has 14 moons.\"","\"The average temperatue of Neptune is about -201 °C.\"","\"There is a 1:20 million scale model of the solar system in Sweden.\"","\"The gap between the Earth and our moon is bigger than the diameters of all the planets combined.\"","\"The first accurate calculation of the speed of light was using Jupiter's moons\"","\"Jupiter's magnetic field is believed to be a result of rapidly spinning metallic hydrogen at the core, and is ~10x stronger than the Earth's.\"","\"Venus spins backwards.\"","\"Uranus spins sideways, relative to the ecliptic plane of the solar system.\"","\"It is easier to reach Pluto or escape the solar system from Earth than being able to land on the Sun.\"", "The most common breed of cat is the domestic shorthair.","Bengal cats are the best cats.","Female cats generally hate human women.","Cats are amazing creatures that are compassionate and caring.","Cats are extremely sneaky and stealthy creatures.","Cats like to eat your eyelids first because it's like jerky to them.","The domestic housecat is a member of the family Felidae.","There is a cat that lived to be nineteen years old and in his prime weighed 25 pounds of pure muscle.","Cats and dogs are usually portrayed as enemies in the media.","\"There is a type of cat has beautiful, long, fluffy ginger colored hair.\"","Some cats like to sleep","\"Cats have a third eyelid, known as the nictitating membrane, that covers their eye to protect from injury or while they are in very deep sleep.\"","Cats can see in the dark.","A person on the internet had a grey cat named lucy","Cats have four legs.","Cats are enjoyable little critters with unique personalities that vary widely.","\"There is a cat that when she is excited or wants something, she stands up on her two back legs and looks up at you.\"","Some cats when adopted believe their owners to be their monther","There was a siemese cat who ran away after it's owner moved","Cats are cute","\"Cats will, when they find a mouse, bring it to it's owners room\"","Cats have 500 skeletal muscles.","Cats have 230 bones.","Cat's loves to play with paper bags.","Cats are selfish which makes them pretty good pets for lazy people.","Cats can cause damage to furniture by scratching with their claws.","Many cats enjoy hunting small animals such as mice and rabbits.","\"Some cats are completely awesome, while others are destructive hell-demons.\"","Cats whiskers help them to navigate in the night.","Cats love to string play.","Cats are very mild-mannered and well-trained.","Cats are mammals.","\"It takes much more effort to befriend a cat, than a dog\"","The cats are scientifically known as Felis silvestris catus","Virtually all calico cats are females.","Cats should be neutered to avoid overpopulation.","Cats genetically cannot taste sweetness","\"There is a cat named Tomas, He is super cute. \"","Maine Coon cats can typically be identified by the fur shaped M on their foreheads.","Some cats eat and sleep all day. They are fun to play with and smell really good.","Cats are intelligent and independent creatures that make great companions for people who lead a busy lifestyle.","It is best not to give a cat ordinary food since canned cat food is much more beneficial","Cats make wonderful pets for the elderly.","There is a cat that loves being draped over a person's shoulders like a scarf","Some cats like the sound of whistling.","Cats are not pack animals.","My cat likes to defy expectations- never does the same thing twice.","Cats are not as cute as kittens.","Cats are very lazy yet very warm creatures.","When cats are mad at you they like to pee on your things.","Cats are the cutest animals in the world.","Persian house cats have round shaped faces.","cats are evil but simply adorable.","Cats are misleading animals that should not be domesticated.","\"Some people are allergic to cats, but enjoy being around them anyway.\"","Adult male cats are a pound heavier than adult female cats.","Cats make you work for their affection; They don't sell out the way dogs do.","Only female cats can be Calico.","\"During the Spanish Inquisition, Pope Innocent VIII proclaimed cats as evil, leading to people killing thousands of cats.\"","Cats are feline vertebrates with a tail.","Some people don't like cats because they only love you when you feed them.","At times cats are used as replacements for dead family members","Cats have an organ inside their mouths called the Jacobson's organ.  This organ is responsible for a cat's heightened senses.","Cats slowly blink their eyes at their humans to indicate friendliness and not being a threat.","Persian cats are one of the most popular breeds of cats!","Get your cat spayed or neutered.","Cats are often infected with a organism called toxoplasma.","Sex isnt pleasurable for female cats it is in fact quite painful for them.","Long hair cats cause less allergies than short hair cats.","Cats purr when they are happy.","\"Cats were domesticated about 10,000 years ago by the ancient Egyptians.\"","Cats demonstrate their superior hunting ability through their pursuit of the fabled red dot.","My cat seems to enjoy sticking her head into people's shoes.","Cats can be diabetic.","\"If you buy your cat a toy, the cat will like the box the toy came in more than the toy itself.\"","Cat owners tend to be female.","Cats have a tendency to be distracted easily by fast moving like a moving laser dot.","\"Some people find cats to be irritating animals, obivously they don't have catfacts\"","Cats can be very unique companions.","There is a kitten named caley loves to play with the water in the bath tub.","\"There is a cat that weighs nineteen pounds, and his stomach drags the floor when he walks.\"","\"Someone somewhere has a cat that is a long-haired tortoiseshell with white, brown, and gray fur.\"","\"Cats are funny, like a woman, want attention only when they are ready.\"","all cats are born blind and the ability to see comes during the first couple of weeks after birth.","My cat does not drink out of a still bowl. It will only drink out of the moving fountain or the fish bowl (but will not eat/attack the fish at all).","\"Cats are very agile, and some will hunt every day\"","Cats can fall from high heights and yet still be undamaged to the bone and muscle structure of their legs.","Female cats do not ovulate until the male has penetrated them.","Cat saliva can cause allergic reactions in some people.","Cats are less fun than dogs.","\"Tom cats have a barbed penis that will ruin the vaginal walls of a queen, rendering her unusable to the other toms, meaning that his seed will be passed on. \"","\"My cat, Nicky likes to sleep in the dryer on top of all the clean clothes.\"","My cat likes to sleep on my yoga mat.","\"In ancient Egypt, cats were considered sacred to the goddess Bast, and as a result were sometimes mummified\"","A random internet user's cat has a chipped left nail on her right paw.","\"Some cats actually have super natural powers, and are immortal\"","Cats love to sit inside of boxes.","The first domesticated cats date back to the time of the Egyptians.","Many cats mistake human faces for cat beds.","Cat's shed non-stop.","Cats enjoying soaking up solar power in order to power their lazers","Cats have been proven to be able to land on their feet from falls as high as four stories.","\"Some cats like to fetch, like dogs do.\"","There is a cat who is a master of the instant death palm strike","\"If you tickle a cat's lips, the cat will pretend not to enjoy it.\"","Cats can jump over very large fences.","Some cats age just like humans","Cats have better hearing than humans.","Cats do not often resort to capslock while talking on the internet","Cats do not really have nine lives!","House cats generally have 18 claws.","\"cats get stressed when moved to a new house, catnip helps de-stress them.\"","Some cats are capable of telepathic communication","Cats can have many different personalities; each cat is unique.","Cats with two different color eyes have a particularly strong psycho-kinesis","Cats are actually a woman's best friend!","\"Cat's sometimes hiss at bubbles, thinking they are under attack.\"","\"The typical cat has two eyes, one nose, one mouth and whiskers.\"","Chai tea is a repressing agent for cats psychic powers","The reason cat urine is so potent in smell and concentration is due to their evolution from desert cats.","Male calico cats are very rare and usually sterile.","Some cats come with many names; such as Lucy or Goose Goose.","\"Cats have the ability to squeeze through small spaces, such as under a fence.\"","Cats named buffy have a habbit of hunting rouge vampire cats","Cutting cats whiskers is bad to do because they rely on them for balance.","Cats enjoy waking up their human owners at 6am on Saturday mornings.","Domesticated cats are actually deadly killers.","Cats are usually more independent animals compared to other pets.","Cats are unreliable creatures- you can't depend on them to do anything.","\"Cats are soft, warm, and dangerous wild cards\"","\"Cats can learn to play tag, by chasing them and then running away as they chase you back.\"","\"Dorito's Cool ranch chips, are actually just crack for cats\"","\"After opening the front door,  the colder it is outside, the longer a cat will decide if he want to stay or go.\"","Sphynx cats are hairless cats that need to be bathed every couple of days; thankfully they like water!","Some cats manipulate their owners using subtle hints and full blown brain washing tactics","\"Cats who eat dog food are traitors, and will be hunted by the ruling council\"","A common form of cat assult is to attack the shins of the human enemy","Cats developed the fur their currently have as a way to manipulate humans","When a cat winks at you it is a sign that they like and trust you.","\"Contrary to popular belief, most cats are unable to digest dairy milk and will get an upset stomach.\"","House cats branched off from the large wild cats","Many people are manipulated by cats","Cats only enter human work places to spy","\"Calico cats are always female, except when they cross dress\"","\"Sharing tuna with a cat, is an ancient ritual to become cat women\"","Cats enjoy tinsel during the holiday times!","Cats chase laser pointers due to their resemblence to their arch nemsis","Cat's eyes glow because of a special reflective layer called tapetum lucidum.","Cats have barbs on their tongues to help them lap up water?","Cats don't die from falling from a tall place.","Pure black cats are part of the ancient cat voodo cult","Cats whiskers help them sense the world around them.","Cats like pokemon use defense curl","Cats who are abused always get revenge","\"Cats never meow to each other, they only purr.\"","Catnip makes cats act happy because of of a chemical called nepetalactone.","\"Cats absolutely love the taste of milk, but it turns out that most of them are allergic to it.\"","Cats are the most athletic during the summer","Cats sleep under beds in order to spy on their owners","Cats enjoying stealing humans property to cause strife","Cats with emerald eyes are capable of human speech","Cats enjoy being scratched on their heads and tummies.","Cats can not taste sweetness at all.","PETA is actually controlled by a shadowy group of cats","Cats enjoy a good game of hockey","\"Some cats have been known, from time to time, to confuse your leg with a large slab of bacon, and will treat it as such, much to your dismay.\"","\"Cats despite trying to take over the world, enjoy having their stomach scratched\"","Things cats do are ridiculous.","Cats are incapable of seeing windows","\"A cat always lands in four legs, from what ever distance it jumps.\"","Cats who play fetch are sleeper agents","\"My cat is fat and lazy, the only time he comes to hang out is when he is hungry.\"","Siamese cats get their name from Siam - a country now known as Thailand.","Cats poop outside their litter box if they are sick or stressed out.","Did you know that cats were often buried alive with Egyptian Pharaohs?"]